# Add Nerd Fonts tap
tap "homebrew/cask-fonts"

# Require sha signature for security purposes
cask_args require_sha: true

# Improve Terminal experience
brew "neovim"
brew "tmux"
brew "fd"
brew "ripgrep"
brew "neofetch"
brew "lsd"

# CLI dev tools
brew "php"
brew "composer"
brew "gradle"
brew "cmake"
brew "pyenv"
brew "poetry"

# CLI security tools
brew "gnupg"

# Dev
brew "openjdk"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Apps
cask "arc"
cask "discord"
cask "iterm2"
cask "obsidian"
cask "adobe-creative-cloud"
cask "gitkraken"
cask "vscodium"
cask "linearmouse"
cask "1password"
cask "google-chrome"
cask "min"
cask "logi-options-plus"
cask "protonvpn"
cask "setapp"
cask "wireshark"
cask "anki"
cask "raycast"
cask "focusrite-control"
cask "jetbrains-toolbox"
